from telegram import ReplyKeyboardMarkup

# Список курсов
COURSES = ["Курс 1", "Курс 2", "Курс 3", "Курс 4", "Курс 5"]

# Словарь вопросов по курсам
QUESTIONS = {
    "Курс 1": ["Вопрос 1", "Вопрос 2", "Вопрос 3", "Вопрос 4", "Вопрос 5"],
    "Курс 2": ["Вопрос 1", "Вопрос 2", "Вопрос 3", "Вопрос 4", "Вопрос 5"],
    "Курс 3": ["Вопрос 1", "Вопрос 2", "Вопрос 3", "Вопрос 4", "Вопрос 5"],
    "Курс 4": ["Вопрос 1", "Вопрос 2", "Вопрос 3", "Вопрос 4", "Вопрос 5"],
    "Курс 5": ["Вопрос 1", "Вопрос 2", "Вопрос 3", "Вопрос 4", "Вопрос 5"]
}

# Функция для создания клавиатуры с курсами
def course_keyboard():
    return ReplyKeyboardMarkup([[course] for course in COURSES], resize_keyboard=True, one_time_keyboard=True)
